In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
sns.set()

In [2]:
data = pd.read_csv('files/titanic_clean.csv')

In [3]:
data.head()

   Survived  Class  Gender   Age  SipSp  ParCh     Fare Emb
0         0      3    male  22.0      1      0   7.2500   S
1         1      1  female  38.0      1      0  71.2833   C
2         1      3  female  26.0      0      0   7.9250   S
3         1      1  female  35.0      1      0  53.1000   S
4         0      3    male  35.0      0      0   8.0500   S

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
Survived    891 non-null int64
Class       891 non-null int64
Gender      891 non-null object
Age         891 non-null float64
SipSp       891 non-null int64
ParCh       891 non-null int64
Fare        891 non-null float64
Emb         889 non-null object
dtypes: float64(2), int64(4), object(2)
memory usage: 55.8+ KB

In [5]:
data.nunique()

Survived      2
Class         3
Gender        2
Age          89
SipSp         7
ParCh         7
Fare        248
Emb           3
dtype: int64

In [8]:
data[['Gender','Emb']].describe()

       Gender  Emb
count     891  889
unique      2    3
top      male    S
freq      577  644

In [10]:
data['Gender'] = data['Gender'].astype('category')

In [11]:
data['Emb'] = data['Emb'].astype('category')

In [12]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
Survived    891 non-null int64
Class       891 non-null int64
Gender      891 non-null category
Age         891 non-null float64
SipSp       891 non-null int64
ParCh       891 non-null int64
Fare        891 non-null float64
Emb         889 non-null category
dtypes: category(2), float64(2), int64(4)
memory usage: 43.8 KB

In [13]:
###

In [14]:
data2 = pd.read_csv('files/summer_clean.csv')

In [18]:
data2.describe(include=["O"]) #include all object dataType

,City,Sport,Discipline,Athlete_Name,Country,Gender,Event,Medal
count,31161,31161,31161,31161,31161,31161,31161,31161
unique,22,43,67,22760,147,2,666,3
top,London,Aquatics,Athletics,"Phelps, Michael",USA,Men,Football,Gold
freq,3563,4170,3637,22,4585,22744,1497,10484

In [19]:
data2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31161 entries, 0 to 31160
Data columns (total 9 columns):
Year            31161 non-null int64
City            31161 non-null object
Sport           31161 non-null object
Discipline      31161 non-null object
Athlete_Name    31161 non-null object
Country         31161 non-null object
Gender          31161 non-null object
Event           31161 non-null object
Medal           31161 non-null object
dtypes: int64(1), object(8)
memory usage: 2.1+ MB

In [20]:
data2.nunique()

Year               27
City               22
Sport              43
Discipline         67
Athlete_Name    22760
Country           147
Gender              2
Event             666
Medal               3
dtype: int64

In [22]:
data2['City'] = data2['City'].astype('category')

In [23]:
data2['Sport'] = data2['Sport'].astype('category')

In [24]:
data2['Discipline'] = data2['Discipline'].astype('category')

In [25]:
data2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31161 entries, 0 to 31160
Data columns (total 9 columns):
Year            31161 non-null int64
City            31161 non-null category
Sport           31161 non-null category
Discipline      31161 non-null category
Athlete_Name    31161 non-null object
Country         31161 non-null object
Gender          31161 non-null object
Event           31161 non-null object
Medal           31161 non-null object
dtypes: category(3), int64(1), object(5)
memory usage: 1.5+ MB

In [29]:
data2[['Country','Gender','Medal']] = data2[['Country','Gender','Medal']].astype('category')

In [30]:
data2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31161 entries, 0 to 31160
Data columns (total 9 columns):
Year            31161 non-null int64
City            31161 non-null category
Sport           31161 non-null category
Discipline      31161 non-null category
Athlete_Name    31161 non-null object
Country         31161 non-null category
Gender          31161 non-null category
Event           31161 non-null object
Medal           31161 non-null category
dtypes: category(6), int64(1), object(2)
memory usage: 955.2+ KB